benchmark_results_replicated/20260803_085536/analysis/rep8/run/go_mock_c100/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-mock
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.53ms    1.66ms  12.08ms   63.71%
    Req/Sec    10.26k   231.96    11.87k    69.62%
  Latency Distribution
     50%    2.41ms
     75%    3.62ms
     90%    4.88ms
     99%    6.67ms
  2450820 requests in 1.00m, 299.17MB read
Requests/sec:  40841.17
Transfer/sec:      4.99MB
P95: 5623
P99: 6668